#include "includes.h"
// *****************************************************************************
// 函数名称：delay_us
// 功能描述：延时函数
// 输入参数: /
// 输出参数: /
// 返回参量: /
// *****************************************************************************
void delay_us(U16 nus)
{    
   U16 i=0;  
   while(nus--)
   {
      i=10;  //自己定义
      while(i--) ;    
   }
}

//毫秒级的延时
void delay_ms(U16 nms)
{    
   U16 i=0;  
   while(nms--)
   {
      i=12000;  //自己定义
      while(i--) ;    
   }
}


































